app/views/comments/_comment.html.erb

<div data-comment-id="<%= comment.id %>" style="margin-bottom: 20px">
	<h5><%= Author.find(comment.author_id).fullname %></h5>
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]