app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
	def destroy
		@comment = Comment.find(params[:id])
		@comment.destroy

INSERT INTO "comments" ("title", "content", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dupa"], ["content", "dupa"], ["author_id", 4], ["created_at", "2018-07-14 15:47:27.258122"], ["updated_at", "2018-07-14 15:47:27.258122"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.save