app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    if Author.exists?(@post.author_id)
      @author = Author.find(@post.author_id)
    else
      @author = Author.new(name: "doesn't exist")
    end

    @comments = Comment.where(post_id: @post.id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? LIMIT ?  [["post_id", 9], ["LIMIT", 1]]

  def new
    @post = Post.new
    @authors = Author.all
---
SELECT "authors"."id" FROM "authors"

  def create
    @post = Post.new(post_params)
    @authors = Author.all
    if @post.save
---
SELECT "authors".* FROM "authors"
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "Spaghetti"], ["content", "dasdasdasdasdas"], ["created_at", "2018-07-14 17:22:11.955043"], ["updated_at", "2018-07-14 17:22:11.955043"], ["author_id", 4]]

  def edit
    @post = Post.find(params[:id])
    @authors = Author.all
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "authors"."id" FROM "authors"

  def update
    @post = Post.find(params[:id])
    @authors = Author.all
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "authors".* FROM "authors"
UPDATE "posts" SET "author_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["author_id", 4], ["updated_at", "2018-07-14 13:44:17.878920"], ["id", 9]]